; domain
(define (domain Nasa_strips_activity_model)

;; =====
;; REQUIREMENTS
;; =====

(:requirements :strips :typing :adl)

;; =====
;; TYPES
;; =====
(:types 
	crew_members activity location days  - objects
)

;; =====        
;; PREDICATES
;; =====
(:predicates
	(in_order ?day1 - days ?day - days)
	(performing_activity ?wrt - activity ?crmem - crew_members)
	(blocked_location ?loc - location)
	(busy_crewmember ?crmem - crew_members)
	(complete_day ?day - days)
	(day_in_progress ?day - days)
	(already_completed ?wrt - activity ?crmem - crew_members ?day - days)
	(inordercrewmember ?crmem1 - crew_members ?crmem - crew_members)
	(revordercrewmember ?crmem1 - crew_members ?crmem - crew_members)
	(inordertasks ?wrt1 - activity ?wrt - activity)
	(firstcrewmember ?crmem - crew_members)
	(firsttask ?wrt - activity)
	(lastcrewmember ?crmem - crew_members)
	(lasttask ?wrt - activity)
	(location_used_by ?loc - location ?crmem - crew_members)
	(day_in_progress_for_crewmember ?crmem - crew_members)
	(day_completed ?crmem - crew_members ?day - days)
)

;; =====
;; ACTIONS
;; =====

(:action starting_day
        :parameters (?day - days ?day1 - days)
        
	:precondition (and(not(day_in_progress ?day))
	(not(complete_day ?day))
	(complete_day ?day1)
	(in_order ?day1 ?day))
        
	:effect (and(day_in_progress ?day))
)

(:action starting_day_for_crew_member 
	:parameters (?crmem - crew_members ?crmem1 - crew_members ?day - days)
	:precondition (and
			(not(day_completed ?crmem ?day)) 
			(not(day_in_progress_for_crewmember ?crmem))
			(or(lastcrewmember ?crmem)(and
			(revordercrewmember ?crmem1 ?crmem)
			(day_in_progress_for_crewmember ?crmem1)))				
			(day_in_progress ?day))
	:effect (and(day_in_progress_for_crewmember ?crmem))
)

(:action starting_activity 
	:parameters (?wrt - activity ?wrt1 - activity ?crmem - crew_members ?loc - location ?day - days)
	
	:precondition(and
	(day_in_progress ?day)
	(day_in_progress_for_crewmember ?crmem)
	(or(firsttask ?wrt)
	(and(inordertasks ?wrt1 ?wrt)
	(already_completed ?wrt1 ?crmem ?day)))	
	(not(performing_activity ?wrt ?crmem))	
	(not(already_completed ?wrt ?crmem ?day))
	(not(busy_crewmember ?crmem))
	(not(location_used_by ?loc ?crmem))
	(not(blocked_location ?loc)))
	
	:effect(and
	(performing_activity ?wrt ?crmem)
	(location_used_by ?loc ?crmem)
	(busy_crewmember ?crmem)
	(blocked_location ?loc))
)

(:action completing_activity 
	:parameters (?wrt - activity ?crmem - crew_members ?loc - location ?day - days)
	
	:precondition (and
	(day_in_progress ?day)
	(day_in_progress_for_crewmember ?crmem)
	(location_used_by ?loc ?crmem)
	(not(already_completed ?wrt ?crmem ?day))
	(performing_activity ?wrt ?crmem)
	(blocked_location ?loc))

	:effect (and
	(not(performing_activity ?wrt ?crmem))
	(not(busy_crewmember ?crmem))
	(not(location_used_by ?loc ?crmem))
	(not(blocked_location ?loc))
	(already_completed ?wrt ?crmem ?day))
)

(:action ending_day_for_crew_member 
	:parameters (?crmem - crew_members ?wrt - activity ?crmem1 - crew_members  ?day - days)
	:precondition (and
			(already_completed ?wrt ?crmem ?day)
			(lasttask ?wrt)
			(day_in_progress_for_crewmember ?crmem)
			(not(day_completed ?crmem ?day))
			(or(firstcrewmember ?crmem)(and
			(inordercrewmember ?crmem1 ?crmem)
			(not(day_in_progress_for_crewmember ?crmem1))
			(day_completed ?crmem1 ?day)))
			(day_in_progress ?day))

	:effect (and
		(not(day_in_progress_for_crewmember ?crmem))	
		(day_completed ?crmem ?day))
)


(:action completing_day
        :parameters (?crmem - crew_members ?day - days)
        
	:precondition (and(day_completed ?crmem ?day)		
			(lastcrewmember ?crmem)
			(day_in_progress ?day))
        
	:effect (and(not(day_in_progress ?day))
		(complete_day ?day))
)







)

; problem
(define (problem Nasa_strips_activity_model_prob01)
(:domain Nasa_strips_activity_model)

;(:requirements :fluents :typing :negative-preconditions :disjunctive-preconditions :equality :existential-preconditions :quantified-preconditions :conditional-effects )

(:objects
        a b c d - crew_members
        first_task work exercise sleep breakfast last_task - activity
        locA locB locC locD locE locF - location
        day0 day1 day2 - days
)

(:init	
	(in_order day0 day1)
	(in_order day1 day2)
	(complete_day day0)
	(firstcrewmember a)
	(firsttask first_task)
	(lastcrewmember d)
	(lasttask last_task)
	(inordertasks first_task breakfast)
	(inordertasks breakfast work)
	(inordertasks work exercise)
	(inordertasks exercise sleep)	
	(inordertasks sleep last_task)
	(inordercrewmember a b)
	(inordercrewmember b c)
	(inordercrewmember c d)
	(revordercrewmember d c)
	(revordercrewmember c b)
	(revordercrewmember b a)


)

(:goal (and
	(complete_day day1)
	(complete_day day2)
)
)

)

; plan
1. (starting_day day1 day0)
   added: (day_in_progress day1)
   goals met: 0 of 2
2. (starting_day_for_crew_member d a day1)
   added: (day_in_progress_for_crewmember d)
   goals met: 0 of 2
3. (starting_activity first_task breakfast d loca day1)
   added: (performing_activity first_task d) (location_used_by loca d) (busy_crewmember d) (blocked_location loca)
   goals met: 0 of 2
4. (completing_activity first_task d loca day1)
   deleted: (performing_activity first_task d) (busy_crewmember d) (location_used_by loca d) (blocked_location loca)
   added: (already_completed first_task d day1)
   goals met: 0 of 2
5. (starting_activity breakfast first_task d loca day1)
   added: (performing_activity breakfast d) (location_used_by loca d) (busy_crewmember d) (blocked_location loca)
   goals met: 0 of 2
6. (completing_activity breakfast d loca day1)
   deleted: (performing_activity breakfast d) (busy_crewmember d) (location_used_by loca d) (blocked_location loca)
   added: (already_completed breakfast d day1)
   goals met: 0 of 2
7. (starting_activity work breakfast d loca day1)
   added: (performing_activity work d) (location_used_by loca d) (busy_crewmember d) (blocked_location loca)
   goals met: 0 of 2
8. (completing_activity work d loca day1)
   deleted: (performing_activity work d) (busy_crewmember d) (location_used_by loca d) (blocked_location loca)
   added: (already_completed work d day1)
   goals met: 0 of 2
9. (starting_activity exercise work d loca day1)
   added: (performing_activity exercise d) (location_used_by loca d) (busy_crewmember d) (blocked_location loca)
   goals met: 0 of 2
10. (completing_activity exercise d loca day1)
   deleted: (performing_activity exercise d) (busy_crewmember d) (location_used_by loca d) (blocked_location loca)
   added: (already_completed exercise d day1)
   goals met: 0 of 2
11. (starting_activity sleep exercise d loca day1)
   added: (performing_activity sleep d) (location_used_by loca d) (busy_crewmember d) (blocked_location loca)
   goals met: 0 of 2
12. (completing_activity sleep d loca day1)
   deleted: (performing_activity sleep d) (busy_crewmember d) (location_used_by loca d) (blocked_location loca)
   added: (already_completed sleep d day1)
   goals met: 0 of 2
13. (starting_day_for_crew_member c d day1)
   added: (day_in_progress_for_crewmember c)
   goals met: 0 of 2
14. (starting_day_for_crew_member b c day1)
   added: (day_in_progress_for_crewmember b)
   goals met: 0 of 2
15. (starting_activity last_task sleep d loca day1)
   added: (performing_activity last_task d) (location_used_by loca d) (busy_crewmember d) (blocked_location loca)
   goals met: 0 of 2
16. (starting_day_for_crew_member a b day1)
   added: (day_in_progress_for_crewmember a)
   goals met: 0 of 2
17. (starting_activity first_task breakfast a locb day1)
   added: (performing_activity first_task a) (location_used_by locb a) (busy_crewmember a) (blocked_location locb)
   goals met: 0 of 2
18. (completing_activity first_task a locb day1)
   deleted: (performing_activity first_task a) (busy_crewmember a) (location_used_by locb a) (blocked_location locb)
   added: (already_completed first_task a day1)
   goals met: 0 of 2
19. (starting_activity breakfast first_task a locb day1)
   added: (performing_activity breakfast a) (location_used_by locb a) (busy_crewmember a) (blocked_location locb)
   goals met: 0 of 2
20. (completing_activity breakfast a locb day1)
   deleted: (performing_activity breakfast a) (busy_crewmember a) (location_used_by locb a) (blocked_location locb)
   added: (already_completed breakfast a day1)
   goals met: 0 of 2
21. (starting_activity work breakfast a locb day1)
   added: (performing_activity work a) (location_used_by locb a) (busy_crewmember a) (blocked_location locb)
   goals met: 0 of 2
22. (completing_activity work a locb day1)
   deleted: (performing_activity work a) (busy_crewmember a) (location_used_by locb a) (blocked_location locb)
   added: (already_completed work a day1)
   goals met: 0 of 2
23. (starting_activity exercise work a locb day1)
   added: (performing_activity exercise a) (location_used_by locb a) (busy_crewmember a) (blocked_location locb)
   goals met: 0 of 2
24. (completing_activity exercise a locb day1)
   deleted: (performing_activity exercise a) (busy_crewmember a) (location_used_by locb a) (blocked_location locb)
   added: (already_completed exercise a day1)
   goals met: 0 of 2
25. (starting_activity sleep exercise a locb day1)
   added: (performing_activity sleep a) (location_used_by locb a) (busy_crewmember a) (blocked_location locb)
   goals met: 0 of 2
26. (completing_activity sleep a locb day1)
   deleted: (performing_activity sleep a) (busy_crewmember a) (location_used_by locb a) (blocked_location locb)
   added: (already_completed sleep a day1)
   goals met: 0 of 2
27. (starting_activity last_task sleep a locb day1)
   added: (performing_activity last_task a) (location_used_by locb a) (busy_crewmember a) (blocked_location locb)
   goals met: 0 of 2
28. (completing_activity last_task a locb day1)
   deleted: (performing_activity last_task a) (busy_crewmember a) (location_used_by locb a) (blocked_location locb)
   added: (already_completed last_task a day1)
   goals met: 0 of 2
29. (starting_activity first_task breakfast c locb day1)
   added: (performing_activity first_task c) (location_used_by locb c) (busy_crewmember c) (blocked_location locb)
   goals met: 0 of 2
30. (completing_activity first_task c locb day1)
   deleted: (performing_activity first_task c) (busy_crewmember c) (location_used_by locb c) (blocked_location locb)
   added: (already_completed first_task c day1)
   goals met: 0 of 2
31. (starting_activity breakfast first_task c locb day1)
   added: (performing_activity breakfast c) (location_used_by locb c) (busy_crewmember c) (blocked_location locb)
   goals met: 0 of 2
32. (completing_activity breakfast c locb day1)
   deleted: (performing_activity breakfast c) (busy_crewmember c) (location_used_by locb c) (blocked_location locb)
   added: (already_completed breakfast c day1)
   goals met: 0 of 2
33. (starting_activity work breakfast c locb day1)
   added: (performing_activity work c) (location_used_by locb c) (busy_crewmember c) (blocked_location locb)
   goals met: 0 of 2
34. (completing_activity work c locb day1)
   deleted: (performing_activity work c) (busy_crewmember c) (location_used_by locb c) (blocked_location locb)
   added: (already_completed work c day1)
   goals met: 0 of 2
35. (starting_activity exercise work c locb day1)
   added: (performing_activity exercise c) (location_used_by locb c) (busy_crewmember c) (blocked_location locb)
   goals met: 0 of 2
36. (completing_activity exercise c locb day1)
   deleted: (performing_activity exercise c) (busy_crewmember c) (location_used_by locb c) (blocked_location locb)
   added: (already_completed exercise c day1)
   goals met: 0 of 2
37. (starting_activity sleep exercise c locb day1)
   added: (performing_activity sleep c) (location_used_by locb c) (busy_crewmember c) (blocked_location locb)
   goals met: 0 of 2
38. (completing_activity sleep c locb day1)
   deleted: (performing_activity sleep c) (busy_crewmember c) (location_used_by locb c) (blocked_location locb)
   added: (already_completed sleep c day1)
   goals met: 0 of 2
39. (starting_activity last_task sleep c locb day1)
   added: (performing_activity last_task c) (location_used_by locb c) (busy_crewmember c) (blocked_location locb)
   goals met: 0 of 2
40. (ending_day_for_crew_member a last_task a day1)
   deleted: (day_in_progress_for_crewmember a)
   added: (day_completed a day1)
   goals met: 0 of 2
41. (starting_activity first_task breakfast b locc day1)
   added: (performing_activity first_task b) (location_used_by locc b) (busy_crewmember b) (blocked_location locc)
   goals met: 0 of 2
42. (completing_activity first_task b locc day1)
   deleted: (performing_activity first_task b) (busy_crewmember b) (location_used_by locc b) (blocked_location locc)
   added: (already_completed first_task b day1)
   goals met: 0 of 2
43. (starting_activity breakfast first_task b locc day1)
   added: (performing_activity breakfast b) (location_used_by locc b) (busy_crewmember b) (blocked_location locc)
   goals met: 0 of 2
44. (completing_activity breakfast b locc day1)
   deleted: (performing_activity breakfast b) (busy_crewmember b) (location_used_by locc b) (blocked_location locc)
   added: (already_completed breakfast b day1)
   goals met: 0 of 2
45. (starting_activity work breakfast b locc day1)
   added: (performing_activity work b) (location_used_by locc b) (busy_crewmember b) (blocked_location locc)
   goals met: 0 of 2
46. (completing_activity work b locc day1)
   deleted: (performing_activity work b) (busy_crewmember b) (location_used_by locc b) (blocked_location locc)
   added: (already_completed work b day1)
   goals met: 0 of 2
47. (starting_activity exercise work b locc day1)
   added: (performing_activity exercise b) (location_used_by locc b) (busy_crewmember b) (blocked_location locc)
   goals met: 0 of 2
48. (completing_activity exercise b locc day1)
   deleted: (performing_activity exercise b) (busy_crewmember b) (location_used_by locc b) (blocked_location locc)
   added: (already_completed exercise b day1)
   goals met: 0 of 2
49. (starting_activity sleep exercise b locc day1)
   added: (performing_activity sleep b) (location_used_by locc b) (busy_crewmember b) (blocked_location locc)
   goals met: 0 of 2
50. (completing_activity sleep b locc day1)
   deleted: (performing_activity sleep b) (busy_crewmember b) (location_used_by locc b) (blocked_location locc)
   added: (already_completed sleep b day1)
   goals met: 0 of 2
51. (starting_activity last_task sleep b locc day1)
   added: (performing_activity last_task b) (location_used_by locc b) (busy_crewmember b) (blocked_location locc)
   goals met: 0 of 2
52. (completing_activity last_task b locc day1)
   deleted: (performing_activity last_task b) (busy_crewmember b) (location_used_by locc b) (blocked_location locc)
   added: (already_completed last_task b day1)
   goals met: 0 of 2
53. (ending_day_for_crew_member b last_task a day1)
   deleted: (day_in_progress_for_crewmember b)
   added: (day_completed b day1)
   goals met: 0 of 2
54. (completing_activity last_task c locb day1)
   deleted: (performing_activity last_task c) (busy_crewmember c) (location_used_by locb c) (blocked_location locb)
   added: (already_completed last_task c day1)
   goals met: 0 of 2
55. (ending_day_for_crew_member c last_task b day1)
   deleted: (day_in_progress_for_crewmember c)
   added: (day_completed c day1)
   goals met: 0 of 2
56. (completing_activity last_task d loca day1)
   deleted: (performing_activity last_task d) (busy_crewmember d) (location_used_by loca d) (blocked_location loca)
   added: (already_completed last_task d day1)
   goals met: 0 of 2
57. (ending_day_for_crew_member d last_task c day1)
   deleted: (day_in_progress_for_crewmember d)
   added: (day_completed d day1)
   goals met: 0 of 2
58. (completing_day d day1)
   deleted: (day_in_progress day1)
   added: (complete_day day1)
   goals met: 1 of 2
59. (starting_day day2 day1)
   added: (day_in_progress day2)
   goals met: 1 of 2
60. (starting_day_for_crew_member d a day2)
   added: (day_in_progress_for_crewmember d)
   goals met: 1 of 2
61. (starting_day_for_crew_member c d day2)
   added: (day_in_progress_for_crewmember c)
   goals met: 1 of 2
62. (starting_day_for_crew_member b c day2)
   added: (day_in_progress_for_crewmember b)
   goals met: 1 of 2
63. (starting_day_for_crew_member a b day2)
   added: (day_in_progress_for_crewmember a)
   goals met: 1 of 2
64. (starting_activity first_task breakfast a loca day2)
   added: (performing_activity first_task a) (location_used_by loca a) (busy_crewmember a) (blocked_location loca)
   goals met: 1 of 2
65. (completing_activity first_task a loca day2)
   deleted: (performing_activity first_task a) (busy_crewmember a) (location_used_by loca a) (blocked_location loca)
   added: (already_completed first_task a day2)
   goals met: 1 of 2
66. (starting_activity breakfast first_task a loca day2)
   added: (performing_activity breakfast a) (location_used_by loca a) (busy_crewmember a) (blocked_location loca)
   goals met: 1 of 2
67. (completing_activity breakfast a loca day2)
   deleted: (performing_activity breakfast a) (busy_crewmember a) (location_used_by loca a) (blocked_location loca)
   added: (already_completed breakfast a day2)
   goals met: 1 of 2
68. (starting_activity work breakfast a loca day2)
   added: (performing_activity work a) (location_used_by loca a) (busy_crewmember a) (blocked_location loca)
   goals met: 1 of 2
69. (completing_activity work a loca day2)
   deleted: (performing_activity work a) (busy_crewmember a) (location_used_by loca a) (blocked_location loca)
   added: (already_completed work a day2)
   goals met: 1 of 2
70. (starting_activity exercise work a loca day2)
   added: (performing_activity exercise a) (location_used_by loca a) (busy_crewmember a) (blocked_location loca)
   goals met: 1 of 2
71. (completing_activity exercise a loca day2)
   deleted: (performing_activity exercise a) (busy_crewmember a) (location_used_by loca a) (blocked_location loca)
   added: (already_completed exercise a day2)
   goals met: 1 of 2
72. (starting_activity sleep exercise a loca day2)
   added: (performing_activity sleep a) (location_used_by loca a) (busy_crewmember a) (blocked_location loca)
   goals met: 1 of 2
73. (completing_activity sleep a loca day2)
   deleted: (performing_activity sleep a) (busy_crewmember a) (location_used_by loca a) (blocked_location loca)
   added: (already_completed sleep a day2)
   goals met: 1 of 2
74. (starting_activity last_task sleep a loca day2)
   added: (performing_activity last_task a) (location_used_by loca a) (busy_crewmember a) (blocked_location loca)
   goals met: 1 of 2
75. (completing_activity last_task a loca day2)
   deleted: (performing_activity last_task a) (busy_crewmember a) (location_used_by loca a) (blocked_location loca)
   added: (already_completed last_task a day2)
   goals met: 1 of 2
76. (ending_day_for_crew_member a last_task a day2)
   deleted: (day_in_progress_for_crewmember a)
   added: (day_completed a day2)
   goals met: 1 of 2
77. (starting_activity first_task breakfast b loca day2)
   added: (performing_activity first_task b) (location_used_by loca b) (busy_crewmember b) (blocked_location loca)
   goals met: 1 of 2
78. (completing_activity first_task b loca day2)
   deleted: (performing_activity first_task b) (busy_crewmember b) (location_used_by loca b) (blocked_location loca)
   added: (already_completed first_task b day2)
   goals met: 1 of 2
79. (starting_activity breakfast first_task b loca day2)
   added: (performing_activity breakfast b) (location_used_by loca b) (busy_crewmember b) (blocked_location loca)
   goals met: 1 of 2
80. (completing_activity breakfast b loca day2)
   deleted: (performing_activity breakfast b) (busy_crewmember b) (location_used_by loca b) (blocked_location loca)
   added: (already_completed breakfast b day2)
   goals met: 1 of 2
81. (starting_activity work breakfast b loca day2)
   added: (performing_activity work b) (location_used_by loca b) (busy_crewmember b) (blocked_location loca)
   goals met: 1 of 2
82. (completing_activity work b loca day2)
   deleted: (performing_activity work b) (busy_crewmember b) (location_used_by loca b) (blocked_location loca)
   added: (already_completed work b day2)
   goals met: 1 of 2
83. (starting_activity exercise work b loca day2)
   added: (performing_activity exercise b) (location_used_by loca b) (busy_crewmember b) (blocked_location loca)
   goals met: 1 of 2
84. (completing_activity exercise b loca day2)
   deleted: (performing_activity exercise b) (busy_crewmember b) (location_used_by loca b) (blocked_location loca)
   added: (already_completed exercise b day2)
   goals met: 1 of 2
85. (starting_activity sleep exercise b loca day2)
   added: (performing_activity sleep b) (location_used_by loca b) (busy_crewmember b) (blocked_location loca)
   goals met: 1 of 2
86. (completing_activity sleep b loca day2)
   deleted: (performing_activity sleep b) (busy_crewmember b) (location_used_by loca b) (blocked_location loca)
   added: (already_completed sleep b day2)
   goals met: 1 of 2
87. (starting_activity last_task sleep b loca day2)
   added: (performing_activity last_task b) (location_used_by loca b) (busy_crewmember b) (blocked_location loca)
   goals met: 1 of 2
88. (completing_activity last_task b loca day2)
   deleted: (performing_activity last_task b) (busy_crewmember b) (location_used_by loca b) (blocked_location loca)
   added: (already_completed last_task b day2)
   goals met: 1 of 2
89. (ending_day_for_crew_member b last_task a day2)
   deleted: (day_in_progress_for_crewmember b)
   added: (day_completed b day2)
   goals met: 1 of 2
90. (starting_activity first_task breakfast c loca day2)
   added: (performing_activity first_task c) (location_used_by loca c) (busy_crewmember c) (blocked_location loca)
   goals met: 1 of 2
91. (completing_activity first_task c loca day2)
   deleted: (performing_activity first_task c) (busy_crewmember c) (location_used_by loca c) (blocked_location loca)
   added: (already_completed first_task c day2)
   goals met: 1 of 2
92. (starting_activity breakfast first_task c loca day2)
   added: (performing_activity breakfast c) (location_used_by loca c) (busy_crewmember c) (blocked_location loca)
   goals met: 1 of 2
93. (completing_activity breakfast c loca day2)
   deleted: (performing_activity breakfast c) (busy_crewmember c) (location_used_by loca c) (blocked_location loca)
   added: (already_completed breakfast c day2)
   goals met: 1 of 2
94. (starting_activity work breakfast c loca day2)
   added: (performing_activity work c) (location_used_by loca c) (busy_crewmember c) (blocked_location loca)
   goals met: 1 of 2
95. (completing_activity work c loca day2)
   deleted: (performing_activity work c) (busy_crewmember c) (location_used_by loca c) (blocked_location loca)
   added: (already_completed work c day2)
   goals met: 1 of 2
96. (starting_activity exercise work c loca day2)
   added: (performing_activity exercise c) (location_used_by loca c) (busy_crewmember c) (blocked_location loca)
   goals met: 1 of 2
97. (completing_activity exercise c loca day2)
   deleted: (performing_activity exercise c) (busy_crewmember c) (location_used_by loca c) (blocked_location loca)
   added: (already_completed exercise c day2)
   goals met: 1 of 2
98. (starting_activity sleep exercise c loca day2)
   added: (performing_activity sleep c) (location_used_by loca c) (busy_crewmember c) (blocked_location loca)
   goals met: 1 of 2
99. (completing_activity sleep c loca day2)
   deleted: (performing_activity sleep c) (busy_crewmember c) (location_used_by loca c) (blocked_location loca)
   added: (already_completed sleep c day2)
   goals met: 1 of 2
100. (starting_activity last_task sleep c loca day2)
   added: (performing_activity last_task c) (location_used_by loca c) (busy_crewmember c) (blocked_location loca)
   goals met: 1 of 2
101. (completing_activity last_task c loca day2)
   deleted: (performing_activity last_task c) (busy_crewmember c) (location_used_by loca c) (blocked_location loca)
   added: (already_completed last_task c day2)
   goals met: 1 of 2
102. (ending_day_for_crew_member c last_task b day2)
   deleted: (day_in_progress_for_crewmember c)
   added: (day_completed c day2)
   goals met: 1 of 2
103. (starting_activity first_task breakfast d loca day2)
   added: (performing_activity first_task d) (location_used_by loca d) (busy_crewmember d) (blocked_location loca)
   goals met: 1 of 2
104. (completing_activity first_task d loca day2)
   deleted: (performing_activity first_task d) (busy_crewmember d) (location_used_by loca d) (blocked_location loca)
   added: (already_completed first_task d day2)
   goals met: 1 of 2
105. (starting_activity breakfast first_task d loca day2)
   added: (performing_activity breakfast d) (location_used_by loca d) (busy_crewmember d) (blocked_location loca)
   goals met: 1 of 2
106. (completing_activity breakfast d loca day2)
   deleted: (performing_activity breakfast d) (busy_crewmember d) (location_used_by loca d) (blocked_location loca)
   added: (already_completed breakfast d day2)
   goals met: 1 of 2
107. (starting_activity work breakfast d loca day2)
   added: (performing_activity work d) (location_used_by loca d) (busy_crewmember d) (blocked_location loca)
   goals met: 1 of 2
108. (completing_activity work d loca day2)
   deleted: (performing_activity work d) (busy_crewmember d) (location_used_by loca d) (blocked_location loca)
   added: (already_completed work d day2)
   goals met: 1 of 2
109. (starting_activity exercise work d loca day2)
   added: (performing_activity exercise d) (location_used_by loca d) (busy_crewmember d) (blocked_location loca)
   goals met: 1 of 2
110. (completing_activity exercise d loca day2)
   deleted: (performing_activity exercise d) (busy_crewmember d) (location_used_by loca d) (blocked_location loca)
   added: (already_completed exercise d day2)
   goals met: 1 of 2
111. (starting_activity sleep exercise d loca day2)
   added: (performing_activity sleep d) (location_used_by loca d) (busy_crewmember d) (blocked_location loca)
   goals met: 1 of 2
112. (completing_activity sleep d loca day2)
   deleted: (performing_activity sleep d) (busy_crewmember d) (location_used_by loca d) (blocked_location loca)
   added: (already_completed sleep d day2)
   goals met: 1 of 2
113. (starting_activity last_task sleep d loca day2)
   added: (performing_activity last_task d) (location_used_by loca d) (busy_crewmember d) (blocked_location loca)
   goals met: 1 of 2
114. (completing_activity last_task d loca day2)
   deleted: (performing_activity last_task d) (busy_crewmember d) (location_used_by loca d) (blocked_location loca)
   added: (already_completed last_task d day2)
   goals met: 1 of 2
115. (ending_day_for_crew_member d last_task c day2)
   deleted: (day_in_progress_for_crewmember d)
   added: (day_completed d day2)
   goals met: 1 of 2
116. (completing_day d day2)
   deleted: (day_in_progress day2)
   added: (complete_day day2)
   goals met: 2 of 2
